sandbox/app/controllers/commodity/admin/skus_controller.rb

SELECT `skus`.* FROM `skus` WHERE `skus`.`id` = 2956 LIMIT 1
---
  def show
    @sku = Sku.find(params[:id])