cms/app/views/taurus/admin/sku_displays/index.html.erb

      <th>#</th>
      <th><%= t 'activerecord.attributes.sku_display.page' %></th>
---
SELECT COUNT(*) FROM `taurus_sku_displays` WHERE (page = 0 and location = 0)