sandbox/app/controllers/commodity/categories_controller.rb

  def office
    @slider_bars = SliderBar.limit(5).all
    @categories = SkuCategory.top_navigation
    @recommendation = SkuDisplay.index_display(:limit => 4, :page => 2, :location => 0)
    @folder_skus = SkuDisplay.index_display(:limit => 8, :page => 2, :location => 1)
    @folder_hots = SkuDisplay.index_display(:limit => 6, :page => 2, :location => 2)
    @notebook_paper_skus = SkuDisplay.index_display(:limit => 8, :page => 2, :location => 3)
    @notebook_paper_hots = SkuDisplay.index_display(:limit => 6, :page => 2, :location => 4)
    @office_skus = SkuDisplay.index_display(:limit => 8, :page => 2, :location => 5)
    @office_hots = SkuDisplay.index_display(:limit => 6, :page => 2, :location => 6)
    @pen_skus = SkuDisplay.index_display(:limit => 8, :page => 2, :location => 7)
    @pen_hots = SkuDisplay.index_display(:limit => 6, :page => 2, :location => 8)
    @off_oper_sup_skus = SkuDisplay.index_display(:limit => 8, :page => 2, :location => 9)
    @off_oper_sup_hots = SkuDisplay.index_display(:limit => 6, :page => 2, :location => 10)
    @other_skus = SkuDisplay.index_display(:limit => 8, :page => 2, :location => 11)
    @other_hots = SkuDisplay.index_display(:limit => 6, :page => 2, :location => 12)

    if current_user.nil?
      @sku_browsing_histories = Hash.new
    else
      @sku_browsing_histories = SkuBrowsingHistory.limit(3).order("quantity desc").where("user_id = #{current_user.id}
        and sku_id in(select id from skus where id in(select sku_id from sku_on_shelves where status = 1))")
    end

    @images = Image.find_all_by_page(2)
---
SELECT `slider_bars`.* FROM `slider_bars` LIMIT 5
SELECT `images`.* FROM `images` WHERE `images`.`page` = 2