auth/app/views/taurus/admin/company_extends/_form.html.erb

SELECT `stores`.* FROM `stores`
---
          <label>仓库</label>
          <%= u_f.select :taurus_store_id, Taurus::Store.all.collect {|s| [ s.name, s.id ] } %><span class="red">*</span>

SELECT `industries`.* FROM `industries`
---
          <%= label_tag t :industry %>
          <%= f.select :taurus_industry_id, Taurus::Industry.all.collect{ |p| [p.name, p.id]} %><span class="red">*</span>

SELECT `taurus_company_types`.* FROM `taurus_company_types`
---
          <%= label_tag t :company_type %>
          <%= f.select :taurus_company_type_id, Taurus::CompanyType.all.collect{ |p| [p.name, p.id]} %><span class="red">*</span>

SELECT `taurus_company_scales`.* FROM `taurus_company_scales`
---
           <%= label_tag t :company_scale %>
           <%= f.select :taurus_company_scale_id, Taurus::CompanyScale.all.collect{ |p| [p.name, p.id]},{:include_blank => "-请选择-"} %>