sandbox/app/controllers/content/slider_bars_controller.rb

SELECT `slider_bars`.* FROM `slider_bars`
---
  def index
    @slider_bars = SliderBar.all