app/controllers/home_controller.rb

SELECT `slider_bars`.* FROM `slider_bars` LIMIT 5
SELECT `images`.* FROM `images` WHERE `images`.`page` = 0
---
  def index
    @slider_bars = SliderBar.limit(5).all
    @categories = SkuCategory.find_all_by_is_show_in_navigation_and_is_show_in_column_and_active_and_parent_id(
                  true,true,true,nil)
    @recommendation = SkuDisplay.index_display(:limit => 4, :page => 0, :location => 0)
    @oa_pc_skus = SkuDisplay.index_display(:limit => 8, :page => 0, :location => 1)
    @oa_pc_hots = SkuDisplay.index_display(:limit => 6, :page => 0, :location => 2)
    @office_skus = SkuDisplay.index_display(:limit => 8, :page => 0, :location => 3)
    @office_hots = SkuDisplay.index_display(:limit => 6, :page => 0, :location => 4)
    @daily_skus = SkuDisplay.index_display(:limit => 8, :page => 0, :location => 5)
    @daily_hots = SkuDisplay.index_display(:limit => 6, :page => 0, :location => 6)
    @off_fur_skus = SkuDisplay.index_display(:limit => 8, :page => 0, :location => 7)
    @off_fur_hots = SkuDisplay.index_display(:limit => 6, :page => 0, :location => 8)
    @liv_fur_skus = SkuDisplay.index_display(:limit => 8, :page => 0, :location => 9)
    @liv_fur_hots = SkuDisplay.index_display(:limit => 6, :page => 0, :location => 10)
    @fur_jew_skus = SkuDisplay.index_display(:limit => 8, :page => 0, :location => 11)
    @fur_jew_hots = SkuDisplay.index_display(:limit => 6, :page => 0, :location => 12)

    if current_user.nil?
      @sku_browsing_histories = Hash.new
    else
      @sku_browsing_histories = SkuBrowsingHistory.limit(3).order("quantity desc").where("user_id = #{current_user.id}
        and sku_id in(select id from skus where status = 1 and id in(select sku_id from sku_on_shelves where status = 1))")
    end


    @images = {}
    Image.find_all_by_page(0).each do |image|

SELECT `announcements`.* FROM `announcements` ORDER BY created_at desc LIMIT 6
---
    end


    @announcements = Announcement.limit(6).order("created_at desc").all