#encoding:UTF-8
class SkuDisplay < ActiveRecord::Base
  belongs_to :sku
  attr_accessor :sku_number

  def self.index_display(options={})
    Sku.order("sku_displays.sequence desc").limit(options[:limit]).on_shelves.
        joins("inner join sku_displays on skus.id = sku_displays.sku_id").
        where("sku_displays.page = ? and sku_displays.location = ?", options[:page], options[:location])
  end

  def page_enum
    { 0 => '首页', 1 => 'OA PC用品', 2 => '文具办公用品', 3 => '生活用品', 4 => '办公家具', 5 => '生活家具', 6 => '家居饰品' }
  end

  def location_enum(page)
    x = { 0 => { 0 => '推荐商品', 1 => 'OA PC', 2  => 'OA PC热销排行', 3  => '文具办公用品', 4  => '文具办公用品热销排行',
            5  => '生活用品', 6  => '生活用品热销排行', 7  => '办公家具', 8  => '办公家具热销排行', 9  => '生活家具',
            10  => '生活家具热销排行', 11  => '家居饰品', 12  => '家居饰品热销排行'},
          1 => { 0 => '推荐商品', 1 => 'OA耗材', 2 => 'OA耗材排行', 3 => 'OA用纸', 4 => 'OA用纸排行', 5 => 'PC用品',
                 6 => 'PC用品排行', 7 => '商务电器', 8 => '商务电器排行', 9 => '多媒体用品', 10 => '多媒体用品排行',
                 11 => '电化消耗品', 12 => '电化消耗品排行', 13 => '事物机器', 14 => '事物机器排行' },
          2 => { 0 => '推荐商品', 1 => '文件夹', 2 => '文件夹排行', 3 => '笔记本・纸制品', 4 => '笔记本・纸制品排行',
                 5 => '办公用品', 6 => '办公用品排行', 7 => '笔类', 8 => '笔类排行', 9 => '办公作业用品', 10 => '办公作业用品排行',
                 11 => '其他文具・办公用品', 12 => '其他文具・办公用品排行' },
          3 => { 0 => '推荐商品', 1 => '酒类', 2 => '酒类排行', 3 => '饮料', 4 => '饮料排行', 5 => '食品', 6 => '食品排行',
                 7 => '饮料用品', 8 => '饮料用品排行', 9 => '生活用品', 10 => '生活用品排行', 11 => '健康管理用品', 12 => '健康管理用品排行',
                 13 => '个人护理', 14 => '个人护理排行', 15 => '票务类', 16 => '票务类排行' ,17 => '其他办公生活用品',
                 18 => '其他办公生活用品排行', 19 => '生活家电', 20 => '生活家电排行' },
          4 => { 0 => '推荐商品', 1 => '办公家具', 2 => '办公家具排行', 3 => '办公饰品', 4 => '办公饰品排行', 5 => '制服', 6 => '制服排行',
                 7 => '办公家电', 8 => '办公家电排行', 9 => '其他家具·装饰品', 10 => '其他家具·装饰品排行' },
          5 => { 0 => '推荐商品', 1 => '客厅家具', 2 => '客厅家具排行', 3 => '餐厅家具', 4 => '餐厅家具排行', 5 => '卧室家具', 6 => '卧室家具排行',
                 7 => '儿童家具', 8 => '儿童家具排行', 9 => '书房家具', 10 => '书房家具排行', 11 => '收纳用品', 12 => '收纳用品排行' },
          6 => { 0 => '推荐商品', 1 => '床上用品', 2 => '床上用品排行', 3 => '纺织饰品', 4 => '纺织饰品排行',
                 5 => '杂货饰品', 6 => '杂货饰品排行', }
    }

        
    x[page]
  end

  validates_presence_of :sku_id, :sku_number, :sequence, :page, :location
end
