cms/app/views/taurus/admin/images/index.html.erb

SELECT COUNT(*) FROM `images`
SELECT `images`.* FROM `images` LIMIT 20 OFFSET 0
---
      <th>#</th>
      <th><%= t('activerecord.attributes.image.page') %></th>